Repository: Behatch/contexts
Catalog: i18n/*.xliff
Languages: fr, ja, pt

# the-header-should-not-be-equal-to
source: the header :name should not be equal to :value
fr: l'entête :name ne derait pas être égale à :value

# the-header-should-not-contain-text
source: the header :name should not contain :value
fr: l'entête :name ne devrait pas contenir :value

# the-header-should-not-contain
source: the header :name should not contain:
fr: l'entête :name ne devrait pas contenir:

# the-json-node-should-contain
source: the JSON node :node should contain :text
ja: /^JSONのノード"(?P<node>[^"]*)"が"(?P<text>[^"]*)"を含むこと$/u

# the-json-node-should-not-exsists
source: the JSON node :name should not exist
ja: /^JSONにノード"(?P<name>[^"]*)"が存在しないこと$/u

# i-send-a-request-on
source: I send a :method request to :url
ja: /^(?:|私が)(?P<method>[A-Z]+)メソッドで"(?P<url>[^"]*)"へリクエストを送る$/u

source: the response should be equal to
ja: /^レスポンスが下記と一致すること:$/u

# the-header-should-equal-to
source: the header :name should be equal to :value
ja: /^"(?P<name>[^"]*)"ヘッダが"(?P<value>[^"]*)"と一致すること$/u
