Repository: Behatch/contexts
Catalog: i18n/*.xliff
Languages: fr, ja, pt

# i-set-basic-authentication
source: I set basic authentication with :user and :password
fr: je remplis l'authentification basique avec :user et :password
ja: /^Basic認証を"(?P<user>[^"]*)"と"(?P<password>[^"]*)"で設定する$/u
pt: eu preencho a autenticação com :user e :password

source: (I )am on url composed by:
fr: (je )suis sur une url composée par:
ja: /^(?:|私が)下記から構成されるURLに遷移する:$/u
pt: (eu )estou em uma url composta por:

# i-click-on-the-nth-element
source: (I )click on the :index :element element
fr: (je )clique sur le :index élément :element
ja: (私が ):index 番目の :element 要素をクリックする
pt: (eu )clico no :indexº elemento :element

# i-follow-the-nth-link
source: (I )follow the :index :link link
fr: (je )suis le :index :link lien
ja: (私が ):index 番目の :link に遷移する
pt: (eu )clico no :index link :link

# i-fill-in-with-the-current-date
source: (I )fill in :field with the current date
fr: (je )remplis :field avec la date actuelle
ja: /^(?:|私が)"(?P<field>[^"]*)"に現在の日付を入力する$/u
pt: (eu )preencho :field com a data atual

# i-fill-in-with-the-current-date-and-modifier
source: (I )fill in :field with the current date and modifier :modifier
fr: (je )remplis :field avec la date actuelle et modificateur :modifier
ja: /^(?:|私が)"(?P<field>[^"]*)"に現在の日付を"(?P<modifier>[^"]*)"で入力する$/u
pt: (eu )preencho :field com a data atual e o modificador :modifier

# i-hover
source: (I )hover :element
fr: (je )survole :element
ja: /^(?:|私が)"(?P<element>[^"]*)"にhoverする$/u
pt: (eu )movo o mouse sobre :element

# i-save-the-value-of-in-the-parameters
source: (I )save the value of :field in the :parameter parameter
fr: (je )sauvegarde la valeur de :field dans le paramètre :parameter
ja: /^(?:|私が)"(?P<field>[^"]*)"の値を"(?P<parameter>[^"]*)"パラメーターに保存する$/u
pt: (eu )salvo o valor de :field no parâmetro :parameter

# i-wait-seconds-until-i-see
source: (I )wait :count second(s) until I see :text
fr: (j')attends :count seconde(s) de voir :text
ja: /^(?:|私が)"(?P<text>[^"]*)"を見るまで(?P<seconds>\d+)秒間?待つ$/u
pt: (eu )espero :count segundo(s) até ver :text

# i-wait-until-i-see
source: (I )wait until I see :text
fr: (j')attends de voir :text
ja: /^(?:|私が)"(?P<text>[^"]*)"を見るまで待つ$/u
pt: (eu )espero até ver :text

# i-wait-seconds-until-i-see-in-the-element
source: (I )wait :count second(s) until I see :text in the :element element
fr: (j')attends (?P<seconds>\d+) secondes? de voir :text dans l'élément (?P<element
ja: /^(?:|私が)"(?P<element>[^"]*)"要素(?:で|に)"(?P<text>[^"]*)"を見るまで(?P<seconds>\d+)秒間?待つ$/u
pt: (eu )espero :count segundo(s) até ver :text no elemento :element

# i-wait-second
source: (I )wait :count second(s)
ja: /^(?:|私が)(?P<seconds>\d+)秒間?待つ$/u
pt: (eu )espero :count segundo(s)

# i-wait-until-i-see-in-the-element
source: (I )wait until I see :text in the :element element
fr: (j')attends de voir :text dans l'élément :element
ja: /^(?:|私が)"(?P<element>[^"]*)"要素(?:で|に)"(?P<text>[^"]*)"を見るまで待つ$/u
pt: (eu )espero até ver :text no elemento :element

# i-wait-for-element
source: (I )wait for :element element
fr: (j')attends l'élément :element
ja: (私が):element要素を見るまで待つ
pt: (eu )espero pelo elemento :element

# i-wait-seconds-for-element
source: (I )wait :count second(s) for :element element
fr: (j')attends :count seconde(s) l'élément :element
ja: (私が ):element 要素を見るまで :count 秒(間)待つ
pt: (eu )espero :count segundo(s) pelo elemento :element

# i-should-see-n-in-the-nth
source: /^(?:|I )should see (?P<count>\d+) "(?P<element>[^"]*)" in the (?P<index>\d+)(?:st|nd|rd|th) "(?P<parent>[^"]*)"$/
fr: /^(?:|je )devrais voir (?P<count>\d+) "(?P<element>[^"]*)" dans le (?P<index>\d+)(?:er|nd|ième) "(?P<parent>[^"]*)"$/
ja: /^(?P<index>\d+)番目の"(?P<parent>[^"]*)"(?:|要素)が(?P<count>\d+)個の"(?P<element>[^"]*)"(?:|要素)を持つこと$/u
pt: /^(?:|eu )devo ver (?P<count>\d+) "(?P<element>[^"]*)" no (?P<index>\d+)(?:º) "(?P<parent>[^"]*)"$/

# i-should-see-less-than-n-in-the-nth
source: (I )should see less than :count :element in the :index :parent
fr: (je )devrais voir moins de :count :element dans le :index :parent
ja: /^(?P<index>\d+)番目の"(?P<parent>[^"]*)"(?:|要素)が(?P<nth>\d+)個以下の"(?P<element>[^"]*)"(?:|要素)を持つこと$/u
pt: /^(?:|eu )devo ver menos que (?P<count>\d+) "(?P<element>[^"]*)" no (?P<index>\d+)(?:º) "(?P<parent>[^"]*)"$/

# i-should-see-more-than-n-in-the-nth
source: (I )should see more than :count :element in the :index :parent
fr: (je )devrais voir plus de :count :element dans le :index :parent
ja: /^(?P<index>\d+)番目の"(?P<parent>[^"]*)"(?:|要素)が(?P<nth>\d+)個以上の"(?P<element>[^"]*)"(?:|要素)を持つこと$/u
pt: /^(?:|eu )devo ver mais que (?P<count>\d+) "(?P<element>[^"]*)" no (?P<index>\d+)(?:º) "(?P<parent>[^"]*)"$/

# the-element-should-be-enabled
source: the element :element should be enabled
fr: l'élément :element devrait être activé
ja: /^"(?P<element>[^"]*)"(?:|要素)が有効であること$/u
pt: o elemento :element deve estar ativo

# the-element-shouls-be-disabled
source: the element :element should be disabled
fr: l'élément :element devrait être désactivé
ja: /^"(?P<element>[^"]*)"(?:|要素)が無効であること$/u
pt: o elemento :element não deve estar ativo

# the-select-box-should-contain
source: the :select select box should contain :option
fr: la liste de sélection :select devrait contenir :option
ja: /^セレクトボックス"(?P<select>[^"]*)"は"(?P<option>[^"]*)"を含むこと$/u
pt: o select :select deve conter :option

# the-select-box-should-not-contain
source: the :select select box should not contain :option
fr: la liste de sélection :select ne devrait pas contenir :option
ja: /^セレクトボックス"(?P<select>[^"]*)"は"(?P<option>[^"]*)"を含まないこと$/u
pt: o select :select não deve conter :option

# the-element-shouls-be-visible
source: the :element element should be visible
fr: l'élément :element devrait être visible
ja: /^要素"(?P<element>[^"]*)"は可視であること$/u
pt: o elemento :element deve estar visível

# the-element-should-not-be-visible
source: the :element element should not be visible
fr: l'élément :element ne devrait pas être visible
ja: /^要素"(?P<element>[^"]*)"は不可視であること$/u
pt: o elemento :element não deve estar visível

# i-switch-to-iframe
source: (I )switch to iframe :name
fr: (je )bascule vers l'iframe :name
ja: (私が ):name iframeにフォーカスする
pt: (eu )mudo para o iframe :name

# i-switch-to-frame
source: (I )switch to frame :name
fr: (je )bascule vers le cadre ":name"
ja: (私が ):name frameにフォーカスする
pt: (eu )mudo o frame :name

source: (I )switch to main frame
fr: (je )bascule vers le cadre principal
ja: (私が )メインフレームにフォーカスする
pt: (eu )mudo para o frame principal

# i-put-the-file-into-field
source: (I )put the file :file into :field
fr: (j')envoie le fichier :file dans :field
ja: /^(?:|私が)ファイル"(?P<file>[^"]*)"を"(?P<field>(?:[^"]|\\")*)"に設定する$/u
pt: (eu )coloco o arquivo :file no campo :field

# i-execute
source: (I )execute :command
fr: (j')exécute :command
ja: /^(?:|私が)"(?P<command>[^"]*)"を実行する$/u
pt: (eu )executo :command

# i-execute-from-project-root
source: (I )execute :command from project root
fr: (j')exécute :command depuis la racine du projet
ja: /^(?:|私が)"(?P<command>[^"]*)"をプロジェクトルートから実行する$/u
pt: (eu )executo :command a partir da raíz do projeto

source: command should succeed
pt: o comando deve ser executado com sucesso

source: command should fail
pt: o comando deve falhar

# command-should-last-lett-than
source: command should last less than :seconds seconds
pt: o comando deve demorar menos que :seconds segundos

# command-should-last-more-than
source: command should last more than :seconds seconds
pt: o comando deve demorar mais que :seconds segundos

# i-create-the-file-contening
source: (I )create the file :filename containing:
fr: (je )crée le fichier :filename contenant :
ja: (私が):filenameというファイルを下記のテキストで作成する:
pt: (eu )crio o arquivo :filename contendo:

# output-should-contain
source: output should contain :text
pt: a saída deve conter :text

# output-should-not-contain
source: output should not contain :text
pt: a saída não deve conter :text

source: output should be:
pt: a saída deve ser:

source: output should not be:
pt: a saída não deve ser:

# print-the-content-of-file
source: print the content of :filename file
fr: imprimer le contenu du fichier :filename
ja: :filenameというファイルのテキストを表示する
pt: exiba o conteúdo do arquivo :filename

source: the response should be in JSON
fr: la réponse devrait être du JSON
ja: /^レスポンスがJSON(?:|形式)であること$/u
pt: a resposta deve estar em JSON

source: the response should not be in JSON
fr: la réponse ne devrait pas être du JSON
ja: /^レスポンスがJSON(?:|形式)でないこと$/u
pt: a resposta não deve estar em JSON

# the-json-node-should-be-equal-to
source: the JSON node :node should be equal to :text
fr: /^le n(?:œ|oe)ud JSON "(?P<node>[^"]*)" devrait être égal à "(?P<text>[^"]*)"$/
ja: /^JSONのノード"(?P<node>[^"]*)"が"(?P<text>[^"]*)"と等しいこと$/u
pt: o nó JSON :node deve ser igual a :text

source: the JSON nodes should be equal to:
fr: /^les n(?:œ|oe)uds JSON devraient être égaux à:$/
pt: os nós JSON devem ser iguais a:

# the-json-node-should-be-null
source: the JSON node :node should be null
pt: o nó JSON :node deve ser null

# the-json-node-should-be-true
source: the JSON node :node should be true
pt: o nó JSON :node deve ser true

# the-json-node-should-be-false
source: the JSON node :node should be false
pt: o nó JSON :node deve ser false

# the-json-node-should-be-the-string
source: the JSON node :node should be equal to the string :text
pt: o nó JSON :node deve ser igual a string :text

# the-json-node-should-be-the-number
source: the JSON node :node should be equal to the number :number
pt: o nó JSON :node deve ser igual ao número :number

# the-json-node-should-have-n-elements
source: the JSON node :node should have :count element(s)
fr: /^le n(?:œ|oe)ud JSON "(?P<node>[^"]*)" devrait avoir (?P<count>\d+) éléments?$/
ja: /^JSONのノード"(?P<node>[^"]*)"が(?P<nth>\d+)個の要素を持つこと$/u
pt: o nó JSON :node deve ter :count elemento(s)

# the-json-node-should-contain-text
source: the JSON node :node should contain :text
fr: /^le n(?:œ|oe)ud JSON "(?P<node>[^"]*)" devrait contenir "(?P<text>[^"]*)"$/
pt: o nó JSON :node deve conter :text

source: the JSON nodes should contain:
fr: /^les n(?:œ|oe)uds JSON devraient contenir:$/
pt: os nós JSON devem conter:

# the-json-node-should-not-contain
source: the JSON node :node should not contain :text
fr: /^le n(?:œ|oe)ud JSON "(?P<node>[^"]*)" ne devrait pas contenir "(?P<text>[^"]*)"$/
ja: /^JSONのノード"(?P<node>[^"]*)"が"(?P<text>[^"]*)"を含まないこと$/u
pt: o nó JSON :node não deve conter :text

source: the JSON nodes should not contain:
pt: os nós JSON não devem conter:

# the-json-node-should-exist
source: the JSON node :name should exist
fr: /^le n(?:œ|oe)ud JSON "(?P<name>[^"]*)" devrait exister$/
ja: /^JSONにノード"(?P<name>[^"]*)"が存在すること$/u
pt: o nó JSON :name deve existir

# the-json-node-should-not-exists
source: the JSON node :name should not exist
fr: /^le n(?:œ|oe)ud JSON "(?P<name>[^"]*)" ne devrait pas exister$/
pt: o nó JSON :name não deve existir

source: the JSON should be valid according to this schema:
fr: le JSON devrait être valide avec ce schéma:
ja: /^JSONが下記のスキーマに従っていること:$/u
pt: o JSON deve ser válido de acordo com esse schema:

# the-json-should-be-valid-according-to-the-schema
source: the JSON should be valid according to the schema :filename
fr: le JSON devrait être valide avec le schéma :filename
ja: /^JSONがスキーマファイル"(?P<filename>[^"]*)"に従っていること$/u
pt: o JSON deve ser válido de acordo com o schema :filename

# the-json-should-be-invalid-according-to-the-schema
source: the JSON should be invalid according to the schema :filename
pt: o JSON deve ser inválido de acordo com o schema :filename

# the-json-should-be-eqal-to
source: the JSON should be equal to:
fr: le JSON devrait être égal à :
ja: /^JSONが下記と一致すること:$/u
pt: o JSON deve ser igual a:

source: print last JSON response
fr: imprimer la dernière réponse JSON
ja: 最後のJSONレスポンスを表示する
pt: exiba a última resposta JSON

# i-send-a-request-to
source: I send a :method request to :url
fr: (j')envoie une requête :method sur :url
pt: (eu )envio uma requisição :method para :url

# i-send-a-request-on-with-parameters
source: I send a :method request to :url with parameters:
fr: (j')envoie une requête :method sur :url avec les paramètres :
ja: /^(?:|私が)(?P<method>[A-Z]+)メソッドで"(?P<url>[^"]*)"へ下記のパラメーターを伴ったリクエストを送る:$/u
pt: (eu )envio uma requisição :method para :url com os parâmetros:

# i-send-a-request-on-with-body
source: I send a :method request to :url with body:
fr: (j')envoie une requête :method sur :url avec le contenu :
ja: /^(?:|私が)(?P<method>[A-Z]+)メソッドで"(?P<url>[^"]*)"へ下記のボディを持ったリクエストを送る:$/u
pt: (eu )envio uma requisição :method para :url com o corpo:

source: the response should be equal to:
fr: la réponse devrait être égale à :
pt: a resposta deve ser igual a:

source: the response should be empty
ja: /^レスポンスが空であること$/u
pt: a resposta deve estar vazia

# the-header-should-be-equal-to
source: the header :name should be equal to :value
fr: l'entête :name devrait être égal à :value
pt: o header :name deve ser igual a :value

# i-add-header-equal-to
source: I add :name header equal to :value
fr: (j')ajoute l'entête :name égale à :value
ja: /^(?:|私が)"(?P<name>[^"]*)"ヘッダに"(?P<value>[^"]*)"を追加する$/u
pt: (eu )adiciono o header :name com o valor :value

# the-header-should-be-contains
source: the header :name should contain :value
fr: l'entête :name devrait contenir :value
ja: /^"(?P<name>[^"]*)"ヘッダが"(?P<value>[^"]*)"を含むこと$/u
pt: o header :name deve conter :value

# the-header-should-not-contain
source: the header :name should not contain :value
ja: /^"(?P<name>[^"]*)"ヘッダが"(?P<value>[^"]*)"を含まないこと$/u
pt: o header :name não deve conter :value

# the-header-should-not-exist
source: the header :name should not exist
fr: l'entête :name ne devrait pas exister
ja: /^"(?P<name>[^"]*)"ヘッダが存在しないこと$/u
pt: o header :name não deve existir

# the-response-should-be-encoded-in
source: the response should be encoded in :encoding
fr: la réponse devrait être encodée en :encoding
ja: /^レスポンスが"(?P<encoding>[^"]*)"でエンコードされていること$/u
pt: a resposta deve estar codificada em :encoding

source: the response should expire in the future
fr: la réponse devrait expirer dans le futur
ja: /^レスポンスが将来期限切れになること$/u
pt: a resposta deve expirar no futuro

source: print last response headers
fr: imprimer les entêtes de la dernière réponse
ja: /^最後のレスポンスヘッダを表示する$/u
pt: exiba os headers da última resposta

source: print the corresponding curl command
fr: imprimer la commande curl correspondante
ja: /^curlコマンドを表示する$/u
pt: exiba o comando curl correspondente

# the-columns-schema-of-the-table-should-match
source: the columns schema of the :table table should match:
fr: le schéma des colonnes du tableau :table devrait correspondre à :
ja: /^テーブル"(?P<table>[^"]*)"のカラムスキーマが下記と一致すること:$/u
pt: as colunas da tabela :table devem ser:

# i-should-ess-n-columns-in-the-tables
source: (I )should see :count column(s) in the :table table
fr: (je )devrais voir :count colonne(s) dans le tableau :table
ja: /^テーブル"(?P<table>[^"]*)"が(?P<nth>\d+)個のカラムを持つこと$/u
pt: (eu )devo ver :count coluna(s) na tabela :table

# i-should-see-n-rows-in-the-nth-tables
source: (I )should see :count rows in the :index :table table
fr: (je )devrais voir :count lignes dans le :index tableau :table
ja: /^(?P<index>\d+)番目のテーブル"(?P<table>[^"]*)"が(?P<nth>\d+)行持つこと$/u
pt: /^(?:|eu )devo ver (?P<count>\d+) linhas na (?P<index>\d+)(?:ª) tabela "(?P<table>[^"]*)"$/

# i-should-see-n-rows-in-the-tables
source: (I )should see :count row(s) in the :table table
fr: (je )devrais voir :count ligne(s) dans le tableau :table
ja: /^テーブル"(?P<table>[^"]*)"が(?P<nth>\d+)行持つこと$/u
pt: (eu )devo ver :count linha(s) na tabela :table

# the-data-in-the-nth-row-of-the-table-should-match
source: the data in the :index row of the :table table should match:
fr: /^les données dans la (?P<index>\d+)(?:ière|nde|ième) ligne du tableau "(?P<table>[^"]*)" devraient correspondre à :$/
ja: /^テーブル"(?P<table>[^"]*)"の(?P<nth>\d+)行目のデータが下記と一致すること:$/u
pt: /^os dados na (?P<index>\d+)(?:ª) linha da tabela "(?P<table>[^"]*)" devem ser iguais a:$/

# the-nth-column-of-the-nth-row-in-the-table-should-contain
source: the :colIndex column of the :rowIndex row in the :table table should contain :text
fr: /^la (?P<colIndes>\d+)(?:ière|nde|ième) colonne de la (?P<rowIndex>\d+)(?:ière|nde|ième) ligne du tableau "(?P<table>[^"]*)" devrait contenir "(?P<text>[^"]*)"$/
ja: /^テーブル"(?P<table>[^"]*)"の(?P<rowIndex>\d+)行目(?P<colIndes>\d+)列が"(?P<text>[^"]*)"を含むこと$/u
pt: /^a (?P<colIndes>\d+)(?:ª) coluna da (?P<rowIndex>\d+)(?:ª) linha da tabela "(?P<table>[^"]*)" deve conter "(?P<text>[^"]*)"$/

source: (I )put a breakpoint
fr: (je )pose un point d'arrêt
ja: /^(?:|私が)ブレークポイントを設置する$/u
pt: (eu )coloco um breakpoint

# i-save-a-screenshot-in
source: I save a screenshot in :filename
fr: (je )sauvegarde une capture d'écran dans :filename
ja: /^(?:|私が)スクリーンショットを"(?P<filename>[^"]*)"に保存する$/u
pt: (eu )salvo uma screenshot em :filename

# the-xml-should-not-use-the-namespace
source: the XML should not use the namespace :namespace
ja: (この)XMLは名前空間 :namespace を使っていないこと
pt: o XML não deve utilizar o namespace :namespace

# the-xml-should-use-the-namespace
source: the XML should use the namespace :namespace
ja: (この)XMLは名前空間 :namespace を使っていること
pt: o XML deve utilizar o namespace :namespace

# the-xml-feed-should-be-valid-accoriding-to-its-dtd
source: the XML feed should be valid according to its DTD
fr: le flux XML devrait être valide avec sa DTD
ja: /^XMLフィードが自身のDTDに従っていること$/u
pt: o XML deve ser válido de acordo com o seu DTD

# the-xml-feed-should-be-valid-according-to-the-xsd
source: the XML feed should be valid according to the XSD :filename
fr: le flux XML devrait être valide avec le XSD :filename
ja: /^XMLフィードがXSDファイル"(?P<filename>[^"]*)"に従っていること$/u
pt: o XML deve ser válido de acordo com o XSD :filename

source: the XML feed should be valid according to this XSD:
fr: le flux XML devrait être valide avec cette XSD :
ja: /^XMLフィードが下記のXSDに従っていること:$/u
pt: o XML deve ser válido de acordo com esse XSD:

# the-xml-feed-should-be-valid-according-to-the-relax-ng
source: the XML feed should be valid according to the relax NG schema :filename
fr: le flux XML devrait être valide avec le schéma relax NG :filename
ja: /^XMLフィードがrelax NG schemaファイル"(?P<filename>[^"]*)"に従っていること$/u
pt: o XML deve ser válido de acordo com o schema relax NG :filename

# the-xml-feed-should-be-valid-according-to-this-relax-ng
source: the XML feed should be valid according to this relax NG schema:
fr: le flux XML devrait être valide avec ce schéma relax NG :
ja: /^XMLフィードが下記のrelax NG schemaに従っていること:$/u
pt: o XML deve ser válido de acordo com esse schema relax NG:

source: the atom feed should be valid
fr: le flux atom devrait être valide
ja: /^atomフィードが妥当であること$/u
pt: o feed atom deve ser válido

source: the RSS2 feed should be valid
fr: le flux RSS2 devrait être valide
ja: /^RSS2フィードが妥当であること$/u
pt: o feed RSS2 deve ser válido

source: print last XML response
ja: 最後のXMLレスポンスを表示する
pt: exiba a última resposta XML

# the-xml-attribute-on-element-should-be-equal-to
source: the XML attribute :attribute on element :element should be equal to :text
ja: (この)XMLの :element 要素の :attribute 属性は :text と一致していること
pt: o atributo XML :attribute no elemento :element deve ser igual a :text

# the-xml-attribute-on-element-should-not-be-equal-to
source: the XML attribute :attribute on element :element should not be equal to :text
ja: (この)XMLの :element 要素の :attribute 属性は :text と一致していないこと
pt: o atributo XML :attribute no elemento :element não deve ser igual a :text

# the-xml-attribute-on-element-should-exists
source: the XML attribute :attribute on element :element should exist(s)
ja: (この)XMLの :element 要素(に)は :attribute 属性が存在していること
pt: o elemento :element deve possuir o atributo XML :attribute

# the-xml-attribute-on-element-should-not-exists
source: the XML attribute :attribute on element :element should not exist(s)
ja: (この)XMLの :element 要素(に)は :attribute 属性が存在していないこと
pt: o elemento :element não deve possuir o atributo XML :attribute

# the-xml-element-should-be-equal-to
source: the XML element :element should be equal to :text
ja: (この)XMLの :element 要素は :text と一致していること
pt: o elemento XML :element deve ser igual a :text

# the-xml-element-should-not-be-equal-to
source: the XML element :element should not be equal to :text
ja: (この)XMLの :element 要素は :text と一致していないこと
pt: o elemento XML :element não deve ser igual a :text

# the-xml-element-should-contain
source: the XML element :element should contain :text
ja: (この)XMLの :element 要素は :text を含んでいること
pt: o elemento XML :element deve conter :text

# the-xml-element-should-not-contain
source: the XML element :element should not contain :text
ja: (この)XMLの :element 要素は :text を含んでいないこと
pt: o elemento XML :element não deve conter :text

# the-xml-element-should-exists
source: the XML element :element should exist(s)
ja: (この)XML(に)は :element 要素が存在していること
pt: o elemento XML :element deve existir

# the-xml-element-should-not-exists
source: the XML element :element should not exist(s)
ja: (この)XML(に)は :element 要素が存在していないこと
pt: o elemento XML :element não deve existir

# the-xml-element-should-have-elements
source: the XML element :element should have :count element(s)
ja: (この)XML(に)は :element 要素を :count 個含んでいること
pt: o elemento XML :element deve ter :count elemento(s)

source: the response should be in XML
ja: レスポンスがXML(形式)であること
pt: a resposta deve estar em XML

source: the response should not be in XML
ja: レスポンスがXML(形式)でないこと
pt: a resposta não deve estar em XML

source: (I )start timing now
fr: (Je )démarre le compteur de temps maintenant

# i-press-the-nth-button
source: (I )press the :index :button button
fr: (Je )presse le :index :button bouton

# i-should-not-see-within-second
source: (I )should not see :text within :count second(s)
fr: (Je )ne devrais pas voir :text durant :count seconde(s)

# i-wait-second
source: (I )wait :count second(s)
fr: (J')attends :count seconde(s)

# the-total-elapsed-time-should-be-than-seconds
source: (the )total elapsed time should be :comparison than :expected seconds
fr: (le )temps total écoulé devrait être :comparaison que :expected secondes

source: command should succeed
fr: la commande devrait réussir

source: command should fail
fr: la commande planter

# command-should-last-lett-than
source: command should last less than :seconds seconds
fr: la commande devrait durer moins de :seconds secondes

# command-should-last-more-than
source: command should last more than :seconds seconds
fr: la commande devrait durer plus de :seconds secondes

# output-should-contain
source: output should contain :text
fr: la sortie devrait contenir :text

# output-should-not-contain
source: output should not contain :text
fr: la sortie ne devrait pas contenir :text

source: output should be:
fr: la sortie devrait être égale à :

source: output should not be:
fr: la sortie ne devrait pas être égale à :

# the-json-node-should-be-null
source: the JSON node :node should be null
fr: /^le n(?:œ|oe)ud JSON "(?P<node>[^"]*)" devrait être nul$/

# the-json-node-should-be-true
source: the JSON node :node should be true
fr: /^le n(?:œ|oe)ud JSON "(?<node>[^"]*)" devrait être vrai$/

# the-json-node-should-be-false
source: the JSON node :node should be false
fr: /^le n(?:œ|oe)ud JSON "(?<node>[^"]*)" devrait être faux$/

# the-json-node-should-be-equal-to-the-string
source: the JSON node :node should be equal to the string :text
fr: /^le n(?:œ|oe)ud JSON "(?<node>[^"]*)" devrait être la chaine de caractère "(?<text>[^"]*)"$/

# the-json-node-should-be-equal-to-the-number
source: the JSON node :node should be equal to the number :number
fr: /^le n(?:œ|oe)ud JSON "(?<node>[^"]*)" devrait être le nombre (?<number>.*)$/

# the-json-nodes-not-should-contain
source: the JSON nodes should not contain:
fr: /^les n(?:œ|oe)uds JSON ne devraient pas contenir:$/
